Revit 2027 API
ConicalSurface.Axis Property
 Axis of the cone. This is the Z axis of the local coordinate system associated with this cone.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Axis { get; }
Public ReadOnly Property Axis As XYZ
	Get
public:
property XYZ^ Axis {
	XYZ^ get ();
}
member Axis : XYZ with get
Property Value
XYZ
See Also
Reference
ConicalSurface Class
Autodesk.Revit.DB Namespace